class ResearchworkParser:
    @staticmethod
    def get_researchworks():
        return [
            (1, "Диплом", "Пишется на 8 семестре"),
            (2, "НИР", "Пишется на протяжении 6-7 семестров"),
            (3, "УИР", "Пишется на 5 семестре"),
            (4, "Зимняя практика", "Пишется на 5 семестре"),
            (5, "Летняя практика", "Пишется на 7 семестре"),
        ]

    @staticmethod
    def get_topics():
        return [
            (1, "Задание", 1),
            (2, "Расширенное содержание пояснительной записки", 1),
            (3, "Пояснительная записка", 1),
            (4, "Презентация", 1),
            (5, "Задание", 2),
            (6, "Расширенное содержание пояснительной записки", 2),
            (7, "Пояснительная записка", 2),
            (8, "Презентация", 2),
            (9, "Задание", 3),
            (10, "Расширенное содержание пояснительной записки", 3),
            (11, "Пояснительная записка", 3),
            (12, "Презентация", 3),
            (13, "Задание", 4),
            (14, "Расширенное содержание пояснительной записки", 4),
            (15, "Пояснительная записка", 4),
            (16, "Презентация", 4),
            (17, "Дневник", 4),
            (18, "Задание", 5),
            (19, "Расширенное содержание пояснительной записки", 5),
            (20, "Пояснительная записка", 5),
            (21, "Презентация", 5),
            (22, "Дневник", 5),
        ]
